import pytest

from ukr.wfst import apply_fst_text, graph


@pytest.mark.parametrize('spoken,expected', [
    ('це трапилося дві тисячі девятнадцятого числа', 'це трапилося 2019 числа'),
    ('коливання в межах трьох копійок експерт оцінив як прийнятні для цього ринку', 'коливання в межах ₴0.03 експерт оцінив як прийнятні для цього ринку'),
    ('збагатила аферистів на три тисячі гривень', 'збагатила аферистів на ₴3000'),
    ('близько двох мільйонів гривень', 'близько ₴2 мільйонів'),
])
def test_word(spoken, expected):
    assert apply_fst_text(spoken, graph) == expected
